module.exports = {
  CLIENT_ERROR: {
    AUTORIZATION: 'Необходима авторизация',
    URL_LINK: 'Введёна некорректная ссылка на статью',
    URL_IMAGE: 'Введёна некорректная ссылка на иллюстрацию',
    EMAIL: 'Неверный email',
    EXIST_EMAIl: 'Уже существует пользователь с таким email',
    DATA: 'Переданы некорректные данные',
    PASSWORD: 'Неправильный пароль',
    PASSWORD_VALID: 'Пароль должен состоять не только из пробелов',
    NOT_EXIST_EMAIL: 'Нет пользователя с таким email',
    FIELDS: 'Заполнены не все поля',
    USER: 'Пользователь не найден',
    FORBIDDEN: 'Недостаточно прав',
    ARTICLE: 'Статья не найдена',
    MANY_REQUESTS: 'Совершено слишком много запросов',
  },
  SUCCESS: { DELETE_ARTICLE: 'Статья удалена' },
  NOT_FOUND: 'Запрашиваемый ресурс не найден',
  SERVER: {
    ERROR: 'На сервере произошла ошибка',
  },
};
